In [1]:
!pip install pyspark

Requirement already satisfied: pyspark in c:\programdata\anaconda3\lib\site-packages (3.2.0)
Requirement already satisfied: py4j==0.10.9.2 in c:\programdata\anaconda3\lib\site-packages (from pyspark) (0.10.9.2)

In [2]:
from pyspark.sql import SparkSession
spark=SparkSession.builder.appName('App3').getOrCreate()

In [3]:
spark

In [4]:
import pandas as pd
pd.read_csv('titanic1.csv')

        Sex   Age     Fare
0      male    22     7.25
1       NaN   NaN  71.2833
2    female    26    7.925
3    female  53.1      NaN
4       NaN   NaN      NaN
..      ...   ...      ...
886    male    27       13
887  female    19       30
888  female     1        S
889    male    26       30
890    male    32     7.75

[891 rows x 3 columns]

In [5]:
from pyspark.sql import SparkSession

In [6]:
spark=SparkSession.builder.appName('App3').getOrCreate()

In [7]:
spark.read.option('header','true').csv('titanic1.csv').show()

+------+----+-------+
|   Sex| Age|   Fare|
+------+----+-------+
|  male|  22|   7.25|
|  null|null|71.2833|
|female|  26|  7.925|
|female|53.1|   null|
|  null|null|   null|
|  male|   0|      Q|
|  male|  54|51.8625|
|  male|null|   null|
|female|  27|11.1333|
|  null|  14|30.0708|
|female|   4|   16.7|
|female|  58|   null|
|  male|  20|   8.05|
|  null|  39| 31.275|
|female|  14| 7.8542|
|female|  16|   null|
|  male|   2| 29.125|
|  null|   0|      S|
|female|  31|     18|
|female|   0|      C|
+------+----+-------+
only showing top 20 rows

In [8]:
df_pyspark=spark.read.option('header','true').csv('titanic1.csv',inferSchema=True)
df_pyspark.show()

+------+----+-------+
|   Sex| Age|   Fare|
+------+----+-------+
|  male|  22|   7.25|
|  null|null|71.2833|
|female|  26|  7.925|
|female|53.1|   null|
|  null|null|   null|
|  male|   0|      Q|
|  male|  54|51.8625|
|  male|null|   null|
|female|  27|11.1333|
|  null|  14|30.0708|
|female|   4|   16.7|
|female|  58|   null|
|  male|  20|   8.05|
|  null|  39| 31.275|
|female|  14| 7.8542|
|female|  16|   null|
|  male|   2| 29.125|
|  null|   0|      S|
|female|  31|     18|
|female|   0|      C|
+------+----+-------+
only showing top 20 rows

In [9]:
df_pyspark.printSchema()

root
 |-- Sex: string (nullable = true)
 |-- Age: string (nullable = true)
 |-- Fare: string (nullable = true)

In [10]:
type(df_pyspark)

pyspark.sql.dataframe.DataFrame

In [11]:
# drop COLUMNS

In [12]:
df_pyspark.drop('Fare').show()

+------+----+
|   Sex| Age|
+------+----+
|  male|  22|
|  null|null|
|female|  26|
|female|53.1|
|  null|null|
|  male|   0|
|  male|  54|
|  male|null|
|female|  27|
|  null|  14|
|female|   4|
|female|  58|
|  male|  20|
|  null|  39|
|female|  14|
|female|  16|
|  male|   2|
|  null|   0|
|female|  31|
|female|   0|
+------+----+
only showing top 20 rows

In [13]:
# drop NULL (na) values

In [14]:
df_pyspark.select().count()

891

In [15]:
df_pyspark.na.drop().select().count()

823

In [16]:
df_pyspark.na.drop().select().count() - df_pyspark.select().count()

-68

In [17]:
df_pyspark.na.drop().show()

+------+---+-------+
|   Sex|Age|   Fare|
+------+---+-------+
|  male| 22|   7.25|
|female| 26|  7.925|
|  male|  0|      Q|
|  male| 54|51.8625|
|female| 27|11.1333|
|female|  4|   16.7|
|  male| 20|   8.05|
|female| 14| 7.8542|
|  male|  2| 29.125|
|female| 31|     18|
|female|  0|      C|
|  male| 34|     13|
|female|  8| 21.075|
|  male|  0|      C|
|  male| 19|    263|
|female|  0|      Q|
|  male| 40|27.7208|
|female|  1|    B78|
|  male| 66|   10.5|
|  male| 28|82.1708|
+------+---+-------+
only showing top 20 rows

In [18]:
# any & how, drop NULL (na) values

In [19]:
df_pyspark.na.drop(how='all').select().count() - df_pyspark.select().count()

-3

In [20]:
df_pyspark.na.drop(how='all').show()

+------+----+-------+
|   Sex| Age|   Fare|
+------+----+-------+
|  male|  22|   7.25|
|  null|null|71.2833|
|female|  26|  7.925|
|female|53.1|   null|
|  male|   0|      Q|
|  male|  54|51.8625|
|  male|null|   null|
|female|  27|11.1333|
|  null|  14|30.0708|
|female|   4|   16.7|
|female|  58|   null|
|  male|  20|   8.05|
|  null|  39| 31.275|
|female|  14| 7.8542|
|female|  16|   null|
|  male|   2| 29.125|
|  null|   0|      S|
|female|  31|     18|
|female|   0|      C|
|  male|  34|     13|
+------+----+-------+
only showing top 20 rows

In [21]:
df_pyspark.na.drop(how='any').select().count() - df_pyspark.select().count()

-68

In [22]:
df_pyspark.na.drop(how='any').show()

+------+---+-------+
|   Sex|Age|   Fare|
+------+---+-------+
|  male| 22|   7.25|
|female| 26|  7.925|
|  male|  0|      Q|
|  male| 54|51.8625|
|female| 27|11.1333|
|female|  4|   16.7|
|  male| 20|   8.05|
|female| 14| 7.8542|
|  male|  2| 29.125|
|female| 31|     18|
|female|  0|      C|
|  male| 34|     13|
|female|  8| 21.075|
|  male|  0|      C|
|  male| 19|    263|
|female|  0|      Q|
|  male| 40|27.7208|
|female|  1|    B78|
|  male| 66|   10.5|
|  male| 28|82.1708|
+------+---+-------+
only showing top 20 rows

In [23]:
# threshold, drop NULL (na) values

In [24]:
df_pyspark.na.drop(how='any', thresh=2).select().count() - df_pyspark.select().count()

-9

In [25]:
df_pyspark.na.drop(how='any', thresh=2).show()

+------+----+-------+
|   Sex| Age|   Fare|
+------+----+-------+
|  male|  22|   7.25|
|female|  26|  7.925|
|female|53.1|   null|
|  male|   0|      Q|
|  male|  54|51.8625|
|female|  27|11.1333|
|  null|  14|30.0708|
|female|   4|   16.7|
|female|  58|   null|
|  male|  20|   8.05|
|  null|  39| 31.275|
|female|  14| 7.8542|
|female|  16|   null|
|  male|   2| 29.125|
|  null|   0|      S|
|female|  31|     18|
|female|   0|      C|
|  male|  34|     13|
|female|  15|   null|
|  male|35.5|   null|
+------+----+-------+
only showing top 20 rows

In [26]:
df_pyspark.na.drop(how='any', thresh=1).select().count() - df_pyspark.select().count()

-3

In [27]:
df_pyspark.na.drop(how='any', thresh=3).select().count() - df_pyspark.select().count()

-68

In [ ]:
# subset, drop NULL (na) values

In [28]:
df_pyspark.na.drop(how='any', subset=['Sex']).select().count() - df_pyspark.select().count()

-28

In [29]:
df_pyspark.na.drop(how='any', subset=['Sex']).show()

+------+----+-------+
|   Sex| Age|   Fare|
+------+----+-------+
|  male|  22|   7.25|
|female|  26|  7.925|
|female|53.1|   null|
|  male|   0|      Q|
|  male|  54|51.8625|
|  male|null|   null|
|female|  27|11.1333|
|female|   4|   16.7|
|female|  58|   null|
|  male|  20|   8.05|
|female|  14| 7.8542|
|female|  16|   null|
|  male|   2| 29.125|
|female|  31|     18|
|female|   0|      C|
|  male|  34|     13|
|female|  15|   null|
|  male|35.5|   null|
|female|   8| 21.075|
|female|null|   null|
+------+----+-------+
only showing top 20 rows